//
//  Rule.swift
//  RankFit
//
//  Created by 한지욱 on 2023/03/12.
//

import Foundation

struct Rule {
    let rule: String = """
서비스 이용규칙 안내

서비스 이용규칙은 누구나 기분 좋게 참여할 수 있는 서비스를 만들기 위해 제정되었습니다. 모든 서비스는 이용규칙에 의해 운영되므로, 이용 전 반드시 모든 내용을 숙지하여야 합니다.

방송통신심의위원회의 정보통신에 관한 심의규정, 현행 법률, 서비스 이용규칙을 위반하거나, 사회 통념 및 관련 법령을 기준으로 타 이용자에게 악영향을 끼치는 경우, 해당 데이터를 삭제할 수 있으며 서비스 이용이 일정 기간 제한될 수 있습니다.

서비스 이용규칙은 불법 행위, 각종 차별 및 혐오, 사회적 갈등 조장, 타인의 권리 침해, 다른 이용자에게 불쾌감을 주는 행위, 시스템 장애를 유발하는 비정상 행위 등 운영에 악영향을 미치는 행위들을 제한하기 위해 지속적으로 개정됩니다. 중대한 변경 사항이 있는 경우에는 공지사항을 통해 고지하므로 반드시 확인해주시기 바랍니다.

서비스 이용규칙에서 사용된 용어의 정의는 서비스 이용약관을 따릅니다.


서비스 운영 시스템

서비스 운영 시스템은 서비스 이용약관 및 서비스 이용규칙 위반을 빠르게 감지하고 조치하기 위해 도입되었습니다.

방송통신심의위원회의 정보통신에 관한 심의규정, 현행 법률, 서비스 이용약관 및 서비스 이용규칙 위반이 확인될 경우, 게시물이 삭제되고 서비스 이용이 일정 기한 제한됩니다. 위반 횟수가 누적될수록 이용 제한 기한 및 수준이 증가할 수 있습니다.

단, 생명 경시 행위, 가족 및 고인 모독 행위, 성적 도의관념에 반하는 행위, 비정상적 서비스 이용과 같이 중대한 서비스 이용규칙 및 현행 법률 위반 행위가 적발될 경우 즉시 1년 이상 서비스 이용이 제한됩니다. 또한 노출 및 음란물 게시 행위, 범죄 및 불법 행위, 계정 판매 및 대리 게시 행위, 홍보/판매 행위와 같이 서비스 이용약관 제9조 및 심각한 현행 법률 위반 행위가 적발될 경우, 서비스 보호 및 안정적인 서비스 운영을 위해 서비스 이용약관 10조에 따라 5년 이상 서비스 이용이 제한되거나, 영구적으로 서비스 이용계약이 해지되며 더 이상 서비스를 이용하실 수 없습니다.

이용 제한 시, 관련한 내용이 서비스 내부 알림 수단을 통해 개별 통지되며, 제한 기한, 적용 범위, 근거 등 상세 내용을 확인하실 수 있습니다.

서비스 이용 중 서비스 이용 약관 및 서비스 이용규칙에 어긋난다고 판단되는 닉네임 및 프로필 사진 지정, 악용 행위를 발견하셨을 경우, 원활하고 신속한 처리를 위해 신고 버튼을 눌러 신고해주시기 바랍니다. 신고 시 처리 및 시스템 운영을 위해 최소한의 로그가 수집 및 보관됩니다.

금지 행위
이용자 보호 및 원활한 서비스 제공을 위해 다음에 해당하는 닉네임 및 프로필 사진 지정, 악용 행위를 금지하고 있습니다. 본 서비스 이용규칙은 방송통신심의위원회의 정보통신에 관한 심의규정에 따른 심의기준을 기반으로 합니다.

일반 금지 행위

1. 국제 평화, 국제 질서 및 국가 간의 우의를 현저히 해할 우려가 있는 행위
  ● 인종차별·테러 등 국제 평화 및 국제질서를 현저히 해할 우려가 있는 행위
  ● 외국의 국기·국장 등을 모독함으로써 국익에 반하거나 국가 간의 우의를 현저히 해할 우려가 있는 행위
  ● 그 밖에 외국의 정치·종교·문화·사회에 대한 비방·비하·멸시 등 국가 간의 우의를 현저히 해할 우려가 있는 행위

2. 헌법에 위배되거나 국가의 존립을 해하는 행위
  ● 국가의 존립·안전이나 민주주의 기본질서를 현저히 위태롭게 할 우려가 있는 행위
  ● 헌법을 부정하거나 국가기관을 마비시킬 우려가 현저한 행위
  ● 법령에 따라 분류된 비밀 등 국가기밀을 누설하는 행위
  ● 「국가보안법」에서 금지하는 행위를 수행하는 행위
  ● 헌법에 반하여 역사적 사실을 현저히 왜곡하는 행위

3. 범죄 기타 법령에 위반되는 행위
  ● 범죄를 목적으로 하거나 예비·음모·교사·방조할 우려가 현저한 행위
  ● 범죄의 수단이나 방법 또는 범죄에 이르는 과정이나 결과를 구체적으로 묘사하여 범죄를 조장할 우려가 있는 행위
  ● 범죄, 범죄인 또는 범죄단체 등을 미화하여 범죄를 정당하다고 보이게 할 우려가 있는 행위
  ● 그 밖에 범죄 및 법령에 위반되는 위법행위를 조장하여 건전한 법질서를 현저히 해할 우려가 있는 행위

4. 사회통념상 일반인의 성욕을 자극하여 성적 흥분을 유발하고 정상적인 성적 수치심을 해하여 성적 도의관념에 반하는 행위
  ● 신체 부위 또는 성적 행위를 노골적으로 표현 또는 묘사하는 행위
  ● 자극적이고 혐오스런 성적표현 및 남녀 신체에 관한 은어 및 비속어를 사용하여 성행위를 구체적으로 묘사하는 행위
  ● 성폭력행위를 노골적으로 묘사하는 행위
  ● 성행위와 관련된 신음소리 등을 극히 자극적으로 묘사하는 행위
  ● 신체의 일부 또는 도구를 이용한 유사성교행위를 노골적으로 묘사하는 행위
  ● 자위행위 및 전희를 구체적으로 묘사하는 행위
  ● 수간, 시간, 혼음, 근친상간, 가학성·피학성 음란증, 관음증 등 비정상적인 행위를 구체적으로 묘사한 행위
  ● 아동 또는 청소년을 성적 유희의 대상으로 직접적이고 구체적으로 묘사한 행위
  ● 불건전한 모임, 대화, 통화 등 온·오프라인 만남 행위
  ● 유흥 관련 정보 공유, 매매·알선 행위 등 불법 행위
  ● 그 밖에 일반인의 성적 수치심을 현저히 해할 우려가 있는 행위

5. 폭력성·잔혹성·혐오성 등이 심각한 행위
  ● 장애인, 노인, 임산부, 아동 등 사회적인 약자 또는 부모, 스승 등에 대한 살상, 폭행, 협박, 학대행위 등을 구체적으로 묘사하는 행위
  ● 오물, 신체 분비물 등을 구체적·사실적으로 묘사하여 혐오감을 불러일으키는 행위
  ● 수술 장면 등 의료행위를 지나치게 상세히 표현하여 혐오감을 불러일으키는 행위
  ● 흉기 그 밖의 위험한 물건 등을 사용하여 과도하게 신체 또는 시체를 손상하는 등 생명을 경시하는 잔혹한 행위
  ● 동물에 대한 학대, 사체, 포식 등을 구체적으로 표현하여 잔혹감 또는 혐오감을 주는 행위
  ● 과도한 욕설 등 저속한 언어 등을 사용하여 혐오감 또는 불쾌감을 주는 행위
  ● 그 밖에 사람 또는 동물 등에 대한 육체적·정신적 고통 등을 사실적·구체적으로 표현하여 잔혹 또는 혐오감을 주는 행위

6. 사회통합 및 사회질서를 저해하는 행위
  ● 고인에 대한 별명, 농담, 밈(Meme), 자료, 특수문자, 이모티콘 등 비난, 희화적 표현 등 고인 모독 행위
  ● 도박 등 사행심을 조장하는 행위
  ● 미신숭배 등 비과학적인 생활태도를 조장하거나 정당화하는 행위
  ● 특정 종교, 종파 또는 종교의식을 비방, 왜곡하거나 교리를 설파 및 전도, 포교하는 행위
  ● 장애인, 노약자 등 사회적인 소외계층을 비하하는 행위
  ● 학교교육 등 교육을 왜곡하여 현저히 교육기풍을 해하는 행위
  ● 합리적 이유없이 성별, 종교, 장애, 나이, 사회적 신분, 출신, 인종, 지역, 직업 등을 차별하거나 이에 대한 편견을 조장하는 행위
  ● 자살을 목적으로 하거나 이를 미화, 방조 또는 권유하여 자살 충동을 일으킬 우려가 있는 행위
  ● 정당한 사유 없이 정보통신시스템, 데이터 또는 프로그램 등을 훼손·멸실·변경·위조하거나 그 운용을 방해하는 내용의 행위
  ● 성매매를 알선, 유도, 조장, 방조하는 행위
  ● 분란 및 갈등을 유도하거나 조장하는 행위
  ● 그 밖에 사회적 혼란을 현저히 야기할 우려가 있는 행위

7. 타인의 권리를 침해하는 행위
  ● 다른 이용자에게 불쾌감이나 불편함을 주는 행위
  ● 개인정보 유포 등 사생활의 비밀과 자유를 침해할 우려가 현저한 행위
  ● 정당한 권한 없이 타인의 사진, 영상 등을 게재하여 타인의 인격권을 현저히 침해하는 행위
  ● 사람을 비방할 목적으로 공공연하게 타인을 모욕하거나 사실 또는 거짓의 사실을 드러내어 타인의 명예를 훼손하는 행위
  ● 정당한 권한 없이 타인의 상표 또는 저작물 등을 사용, 실시 또는 매개하는 등 특허권, 상표권, 디자인권, 저작권 등 지적재산권을 침해하는 행위
  ● 혐오를 불러일으키는 행위
  ● 그 밖에 정당한 권한 없이 타인의 권리를 침해하는 행위

8. 비정상적 시스템 이용 행위
  ● 서비스 유출, 시스템 해킹, 게시물 크롤링 등 서비스에 악영향을 주는 행위

9. 기타
  ● 위 행위를 간접적으로 또는 유추 가능하도록 행하는 행위
  ● 위 행위를 파일, 이미지 등으로 첨부하는 행위
  ● 본인 또는 타인이 행한 금지행위를 인용하는 행위
  ● 타인으로 하여금 위 행위를 행하도록 간접적으로 돕거나 독려하는 행위
  ● 기타 위 행위와 비슷한 목적을 달성하기 위한 행위 일체

전기통신사업법에 따른 불법촬영물 유통 금지

1. 관련 법령에 따라 시스템에 의해 불법촬영물등 유해정보로 식별되는 자료는 즉시 삭제 또는 블라인드 되고, 해당 게시물 작성자는 일시적으로 최대 7일간 서비스 이용이 제한될 수 있습니다.
2. 실제 불법촬영물 등 유해정보를 게재할 경우 전기통신사업법에 따라 삭제 조치 및 회원 자격이 영구적으로 해지되며, 관련 법률에 따라 처벌받을 수 있습니다.

기타

서비스 이용규칙은 쾌적한 서비스 운영을 위해 주기적으로 업데이트됩니다.

랭크핏은 이용자가 서비스 운영 시스템, 금지 행위 등 서비스 이용규칙을 숙지하지 않아 발생하는 피해에 대하여 랭크핏의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.

이 서비스 이용규칙은 2023년 3월 13일에 제정되었습니다.
"""
}
